meeting/agenda/2024/10-22.org
:PROPERTIES:
:ID:       AF581110-D71F-44B9-96DA-7A1CE4652F09
:END:
#+title: QT4 CG Meeting 095 Agenda 2024-10-22
#+author: Norm Tovey-Walsh
#+filetags: :qt4cg:
#+options: html-style:nil h:6 toc:nil
#+html_head: <link rel="stylesheet" type="text/css" href="/meeting/css/htmlize.css"/>
#+html_head: <link rel="stylesheet" type="text/css" href="../../../css/style.css"/>
#+html_head: <link rel="shortcut icon" href="/img/QT4-64.png" />
#+html_head: <link rel="apple-touch-icon" sizes="64x64" href="/img/QT4-64.png" type="image/png" />
#+html_head: <link rel="apple-touch-icon" sizes="76x76" href="/img/QT4-76.png" type="image/png" />
#+html_head: <link rel="apple-touch-icon" sizes="120x120" href="/img/QT4-120.png" type="image/png" />
#+html_head: <link rel="apple-touch-icon" sizes="152x152" href="/img/QT4-152.png" type="image/png" />
#+options: author:nil email:nil creator:nil timestamp:nil
#+startup: showall

[[../][Agenda index]] / [[https://qt4cg.org][QT4CG.org]] / [[https://qt4cg.org/dashboard][Dashboard]] / [[https://github.com/qt4cg/qtspecs/issues][GH Issues]] / [[https://github.com/qt4cg/qtspecs/pulls][GH Pull Requests]]

* Agenda
:PROPERTIES:
:unnumbered: t
:CUSTOM_ID: agenda
:END:

This meeting will be hosted on Zoom at 16:00BST (15:00GMT, 17:00CEST, 11:00EDT) 

The [[https://us06web.zoom.us/j/83199966275?pwd=SmN6V0RhUGdSTHFHZkd6cjgxVEY2QT09][Zoom meeting]] ID is 831 9996 6275; the passcode is 707664.

See the [[https://qt4cg.org/meeting/logistics.html][meeting logistics]] page for more details.

* Administrivia
:PROPERTIES:
:CUSTOM_ID: administrivia
:END:

** Roll call
:PROPERTIES:
:CUSTOM_ID: roll-call
:END:

** Approve the agenda
:PROPERTIES:
:CUSTOM_ID: accept-agenda
:END:

** Approve minutes of previous meeting
:PROPERTIES:
:CUSTOM_ID: approve-minutes
:END:

Minutes of [[../../minutes/2024/10-15.html][the previous meeting]]. 

** Next meeting
:PROPERTIES:
:CUSTOM_ID: next-meeting
:END:

This meeting is planned for 22 October 2024. The following meeting is scheduled
for 29 October.

Note: The QT4CG operates on European civil time. In Europe and the United
Kingdom, summer time ends on 27 October. In the United States, summer time ends
on 3 November. That means the meeting of 29 October will be one hour later in
the United States.

** Review of open action items [2/7]
:PROPERTIES:
:CUSTOM_ID: open-actions
:END:

(Items marked [X] are believed to have been closed via email before
this agenda was posted.)

+ [ ] QT4CG-080-07: NW to update the build instructions in the README
+ [ ] QT4CG-082-02: DN to work with MK to come to agreement on the fn:ranks proposal
+ [ ] QT4CG-088-01: NW to consider how best to add a dedication to MSM.
+ [ ] QT4CG-088-04: [Someone] needs to update the processing model diagram needs vis-a-vis the static typing feature
+ [ ] QT4CG-089-01: CG to draft a PR that attempts to resolve the operators described in #755 to a smaller number of orthogonal choices.
+ [X] QT4CG-094-01: CG to revise the proposal to serialize as jsonl
  + New PR #1497
+ [X] QT4CG-094-02: CG to revise the proposal to have ~err:stack-trace~ return a function item 
  + Revised PR #1470

** Review of open pull requests and issues
:PROPERTIES:
:CUSTOM_ID: open-pull-requests
:END:

*** Blocked
:PROPERTIES:
:CUSTOM_ID: blocked
:END:

The following PRs are open but have merge conflicts or comments which
suggest they aren’t ready for action.

+ PR [[https://qt4cg.org/dashboard/#pr-1470][#1470]]: 689 fn:stack-trace: replace with $err:stack-trace
+ PR [[https://qt4cg.org/dashboard/#pr-1454][#1454]]: 1449 Relax rules on multiple xsl:includes
+ PR [[https://qt4cg.org/dashboard/#pr-1296][#1296]]: 982 Rewrite of scan-left and scan-right
+ PR [[https://qt4cg.org/dashboard/#pr-1283][#1283]]: 77b Update expressions
+ PR [[https://qt4cg.org/dashboard/#pr-1062][#1062]]: 150bis revised proposal for fn:ranks
+ PR [[https://qt4cg.org/dashboard/#pr-529][#529]]: 528 fn:elements-to-maps

*** Merge without discussion
:PROPERTIES:
:CUSTOM_ID: merge-without-discussion
:END:

The following PRs are editorial, small, or otherwise appeared to be
uncontroversial when the agenda was prepared. The chairs propose that
these can be merged without discussion. If you think discussion is
necessary, please say so.

+ PR [[https://qt4cg.org/dashboard/#pr-1518][#1518]]: Add to changes metadata
+ PR [[https://qt4cg.org/dashboard/#pr-1517][#1517]]: 1516(A) Fix failing F&O examples
+ PR [[https://qt4cg.org/dashboard/#pr-1510][#1510]]: 1509 Drop obsolete/redundant text about "import schema" location hints
+ PR [[https://qt4cg.org/dashboard/#pr-1508][#1508]]: 1507 Make format-integer spec legible
+ PR [[https://qt4cg.org/dashboard/#pr-1505][#1505]]: 1503 Add err:map, err:stack-trace, err:additional to XSLT
+ PR [[https://qt4cg.org/dashboard/#pr-1502][#1502]]: 1458 Arguments that have a default value but don't accept ()

*** Close without action
:PROPERTIES:
:CUSTOM_ID: close-without-action
:END:

It has been proposed that the following issues be closed without action.
If you think discussion is necessary, please say so.

+ Issue [[https://github.com/qt4cg/qtspecs/issues/1179][#1179]]: Editorial: `array:values`, `map:values`
+ Issue [[https://github.com/qt4cg/qtspecs/issues/1169][#1169]]: Maps & Arrays: Consistency & Terminology
+ Issue [[https://github.com/qt4cg/qtspecs/issues/1114][#1114]]: Partial function application: Keywords and placeholders
+ Issue [[https://github.com/qt4cg/qtspecs/issues/1065][#1065]]: fn:format-number: further notes
+ Issue [[https://github.com/qt4cg/qtspecs/issues/735][#735]]: Local functions in XSLT
+ Issue [[https://github.com/qt4cg/qtspecs/issues/573][#573]]: Node construction functions

*** Substantive PRs
:PROPERTIES:
:CUSTOM_ID: substantive
:END:

The following substantive PRs were open when this agenda was prepared.

+ PR [[https://qt4cg.org/dashboard/#pr-1513][#1513]]: 1512 Disallow reserved names in namespace and PI constructors
+ PR [[https://qt4cg.org/dashboard/#pr-1511][#1511]]: 1345 Re-allow bare-brace map constructors everywhere
+ PR [[https://qt4cg.org/dashboard/#pr-1504][#1504]]: 868 fn:intersperse → fn:join, array:join($arrays, $separator)
+ PR [[https://qt4cg.org/dashboard/#pr-1501][#1501]]: 1318 Function Coercion: Records, Maps, Arrays
+ PR [[https://qt4cg.org/dashboard/#pr-1498][#1498]]: 1366 Use ++ and ** operators in EBNF
+ PR [[https://qt4cg.org/dashboard/#pr-1497][#1497]]: 1471 JSON Serialization: json-lines
+ PR [[https://qt4cg.org/dashboard/#pr-1496][#1496]]: 1495 Drop context value static type
+ PR [[https://qt4cg.org/dashboard/#pr-1454][#1454]]: 1449 Relax rules on multiple xsl:includes
+ PR [[https://qt4cg.org/dashboard/#pr-1227][#1227]]: 150 PR resubmission for fn ranks

*** Required for V4.0
:PROPERTIES:
:CUSTOM_ID: required-40
:END:

The following issues are labeled “required for V4.0”.

+ Issue [[https://github.com/qt4cg/qtspecs/issues/1252][#1252]]: Add a new function `fn:html-doc`
+ Issue [[https://github.com/qt4cg/qtspecs/issues/1240][#1240]]: $sequence-of-maps ? info()
+ Issue [[https://github.com/qt4cg/qtspecs/issues/1238][#1238]]: XSLT on-no-match="shallow-copy-all" - revised rules
+ Issue [[https://github.com/qt4cg/qtspecs/issues/1169][#1169]]: Maps & Arrays: Consistency & Terminology
+ Issue [[https://github.com/qt4cg/qtspecs/issues/1127][#1127]]: Binary resources
+ Issue [[https://github.com/qt4cg/qtspecs/issues/1045][#1045]]: Functions to manage namespace usage
+ Issue [[https://github.com/qt4cg/qtspecs/issues/1021][#1021]]: Extend `fn:doc`, `fn:collection` and `fn:uri-collection` with options maps
+ Issue [[https://github.com/qt4cg/qtspecs/issues/1011][#1011]]: fn:transform() improvements
+ Issue [[https://github.com/qt4cg/qtspecs/issues/986][#986]]: Numeric Comparisons
+ Issue [[https://github.com/qt4cg/qtspecs/issues/967][#967]]: XPath Appendix I: Comparisons
+ Issue [[https://github.com/qt4cg/qtspecs/issues/868][#868]]: fn:intersperse → fn:join, array:join($arrays, $separator)
+ Issue [[https://github.com/qt4cg/qtspecs/issues/826][#826]]: Arrays: Representation of single members of an array
+ Issue [[https://github.com/qt4cg/qtspecs/issues/767][#767]]: parse-html(): case of SVG element names
+ Issue [[https://github.com/qt4cg/qtspecs/issues/748][#748]]: Parse functions: consistency
+ Issue [[https://github.com/qt4cg/qtspecs/issues/689][#689]]: fn:stack-trace: replace with $err:stack-trace
+ Issue [[https://github.com/qt4cg/qtspecs/issues/675][#675]]: XSLT streaming rules for new constructs
+ Issue [[https://github.com/qt4cg/qtspecs/issues/501][#501]]: Error handling: Rethrow errors; finally block
+ Issue [[https://github.com/qt4cg/qtspecs/issues/490][#490]]: Control over schema validation in parse-xml(), doc(), etc.
+ Issue [[https://github.com/qt4cg/qtspecs/issues/407][#407]]: XSLT-specific context properties used in function items
+ Issue [[https://github.com/qt4cg/qtspecs/issues/272][#272]]: Setting parameter values in xsl:use-package
+ Issue [[https://github.com/qt4cg/qtspecs/issues/69][#69]]: fn:document, fn:function-available: default arguments

* Technical agenda
:PROPERTIES:
:CUSTOM_ID: technical-agenda
:END:

** PR #1513: 1512 Disallow reserved names in namespace and PI constructors
:PROPERTIES:
:CUSTOM_ID: pr-1513
:END:
See PR [[https://qt4cg.org/dashboard/#pr-1513][#1513]]

** PR #1511: 1345 Re-allow bare-brace map constructors everywhere
:PROPERTIES:
:CUSTOM_ID: pr-1511
:END:
See PR [[https://qt4cg.org/dashboard/#pr-1511][#1511]]

** PR #1504: 868 fn:intersperse → fn:join, array:join($arrays, $separator)
:PROPERTIES:
:CUSTOM_ID: pr-1504
:END:
See PR [[https://qt4cg.org/dashboard/#pr-1504][#1504]]

** PR #1501: 1318 Function Coercion: Records, Maps, Arrays
:PROPERTIES:
:CUSTOM_ID: pr-1501
:END:
See PR [[https://qt4cg.org/dashboard/#pr-1501][#1501]]

** PR #1498: 1366 Use ++ and ** operators in EBNF
:PROPERTIES:
:CUSTOM_ID: pr-1498
:END:
See PR [[https://qt4cg.org/dashboard/#pr-1498][#1498]]

** PR #1497: 1471 JSON Serialization: json-lines
:PROPERTIES:
:CUSTOM_ID: pr-1497
:END:
See PR [[https://qt4cg.org/dashboard/#pr-1497][#1497]]

** PR #1496: 1495 Drop context value static type
:PROPERTIES:
:CUSTOM_ID: pr-1496
:END:
See PR [[https://qt4cg.org/dashboard/#pr-1496][#1496]]

** PR #1454: 1449 Relax rules on multiple xsl:includes
:PROPERTIES:
:CUSTOM_ID: pr-1454
:END:
See PR [[https://qt4cg.org/dashboard/#pr-1454][#1454]]

* Any other business
:PROPERTIES:
:CUSTOM_ID: any-other-business
:END:
