meeting/agenda/2024/10-22.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>QT4 CG Meeting 095 Agenda 2024-10-22</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="/meeting/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="../../../css/style.css"/>
<link rel="shortcut icon" href="/img/QT4-64.png" />
<link rel="apple-touch-icon" sizes="64x64" href="/img/QT4-64.png" type="image/png" />
<link rel="apple-touch-icon" sizes="76x76" href="/img/QT4-76.png" type="image/png" />
<link rel="apple-touch-icon" sizes="120x120" href="/img/QT4-120.png" type="image/png" />
<link rel="apple-touch-icon" sizes="152x152" href="/img/QT4-152.png" type="image/png" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">QT4 CG Meeting 095 Agenda 2024-10-22</h1>
<p>
<a href="../">Agenda index</a> / <a href="https://qt4cg.org">QT4CG.org</a> / <a href="https://qt4cg.org/dashboard">Dashboard</a> / <a href="https://github.com/qt4cg/qtspecs/issues">GH Issues</a> / <a href="https://github.com/qt4cg/qtspecs/pulls">GH Pull Requests</a>
</p>

<div id="outline-container-agenda" class="outline-2">
<h2 id="agenda">Agenda</h2>
<div class="outline-text-2" id="text-agenda">
<p>
This meeting will be hosted on Zoom at 16:00BST (15:00GMT, 17:00CEST, 11:00EDT) 
</p>

<p>
The <a href="https://us06web.zoom.us/j/83199966275?pwd=SmN6V0RhUGdSTHFHZkd6cjgxVEY2QT09">Zoom meeting</a> ID is 831 9996 6275; the passcode is 707664.
</p>

<p>
See the <a href="https://qt4cg.org/meeting/logistics.html">meeting logistics</a> page for more details.
</p>
</div>
</div>

<div id="outline-container-administrivia" class="outline-2">
<h2 id="administrivia"><span class="section-number-2">1.</span> Administrivia</h2>
<div class="outline-text-2" id="text-administrivia">
</div>

<div id="outline-container-roll-call" class="outline-3">
<h3 id="roll-call"><span class="section-number-3">1.1.</span> Roll call</h3>
<div class="outline-text-3" id="text-roll-call">
</div>
</div>

<div id="outline-container-accept-agenda" class="outline-3">
<h3 id="accept-agenda"><span class="section-number-3">1.2.</span> Approve the agenda</h3>
<div class="outline-text-3" id="text-accept-agenda">
</div>
</div>

<div id="outline-container-approve-minutes" class="outline-3">
<h3 id="approve-minutes"><span class="section-number-3">1.3.</span> Approve minutes of previous meeting</h3>
<div class="outline-text-3" id="text-approve-minutes">
<p>
Minutes of <a href="../../minutes/2024/10-15.html">the previous meeting</a>. 
</p>
</div>
</div>

<div id="outline-container-next-meeting" class="outline-3">
<h3 id="next-meeting"><span class="section-number-3">1.4.</span> Next meeting</h3>
<div class="outline-text-3" id="text-next-meeting">
<p>
This meeting is planned for 22 October 2024. The following meeting is scheduled
for 29 October.
</p>

<p>
Note: The QT4CG operates on European civil time. In Europe and the United
Kingdom, summer time ends on 27 October. In the United States, summer time ends
on 3 November. That means the meeting of 29 October will be one hour later in
the United States.
</p>
</div>
</div>

<div id="outline-container-open-actions" class="outline-3">
<h3 id="open-actions"><span class="section-number-3">1.5.</span> Review of open action items <code>[2/7]</code></h3>
<div class="outline-text-3" id="text-open-actions">
<p>
(Items marked [X] are believed to have been closed via email before
this agenda was posted.)
</p>

<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> QT4CG-080-07: NW to update the build instructions in the README</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-082-02: DN to work with MK to come to agreement on the fn:ranks proposal</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-088-01: NW to consider how best to add a dedication to MSM.</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-088-04: [Someone] needs to update the processing model diagram needs vis-a-vis the static typing feature</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-089-01: CG to draft a PR that attempts to resolve the operators described in #755 to a smaller number of orthogonal choices.</li>
<li class="on"><code>[X]</code> QT4CG-094-01: CG to revise the proposal to serialize as jsonl
<ul class="org-ul">
<li>New PR #1497</li>
</ul></li>
<li class="on"><code>[X]</code> QT4CG-094-02: CG to revise the proposal to have <code>err:stack-trace</code> return a function item 
<ul class="org-ul">
<li>Revised PR #1470</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-open-pull-requests" class="outline-3">
<h3 id="open-pull-requests"><span class="section-number-3">1.6.</span> Review of open pull requests and issues</h3>
<div class="outline-text-3" id="text-open-pull-requests">
</div>

<div id="outline-container-blocked" class="outline-4">
<h4 id="blocked"><span class="section-number-4">1.6.1.</span> Blocked</h4>
<div class="outline-text-4" id="text-blocked">
<p>
The following PRs are open but have merge conflicts or comments which
suggest they aren’t ready for action.
</p>

<ul class="org-ul">
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1470">#1470</a>: 689 fn:stack-trace: replace with $err:stack-trace</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1454">#1454</a>: 1449 Relax rules on multiple xsl:includes</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1296">#1296</a>: 982 Rewrite of scan-left and scan-right</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1283">#1283</a>: 77b Update expressions</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1062">#1062</a>: 150bis revised proposal for fn:ranks</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-529">#529</a>: 528 fn:elements-to-maps</li>
</ul>
</div>
</div>

<div id="outline-container-merge-without-discussion" class="outline-4">
<h4 id="merge-without-discussion"><span class="section-number-4">1.6.2.</span> Merge without discussion</h4>
<div class="outline-text-4" id="text-merge-without-discussion">
<p>
The following PRs are editorial, small, or otherwise appeared to be
uncontroversial when the agenda was prepared. The chairs propose that
these can be merged without discussion. If you think discussion is
necessary, please say so.
</p>

<ul class="org-ul">
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1518">#1518</a>: Add to changes metadata</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1517">#1517</a>: 1516(A) Fix failing F&amp;O examples</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1510">#1510</a>: 1509 Drop obsolete/redundant text about "import schema" location hints</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1508">#1508</a>: 1507 Make format-integer spec legible</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1505">#1505</a>: 1503 Add err:map, err:stack-trace, err:additional to XSLT</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1502">#1502</a>: 1458 Arguments that have a default value but don't accept ()</li>
</ul>
</div>
</div>

<div id="outline-container-close-without-action" class="outline-4">
<h4 id="close-without-action"><span class="section-number-4">1.6.3.</span> Close without action</h4>
<div class="outline-text-4" id="text-close-without-action">
<p>
It has been proposed that the following issues be closed without action.
If you think discussion is necessary, please say so.
</p>

<ul class="org-ul">
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1179">#1179</a>: Editorial: `array:values`, `map:values`</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1169">#1169</a>: Maps &amp; Arrays: Consistency &amp; Terminology</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1114">#1114</a>: Partial function application: Keywords and placeholders</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1065">#1065</a>: fn:format-number: further notes</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/735">#735</a>: Local functions in XSLT</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/573">#573</a>: Node construction functions</li>
</ul>
</div>
</div>

<div id="outline-container-substantive" class="outline-4">
<h4 id="substantive"><span class="section-number-4">1.6.4.</span> Substantive PRs</h4>
<div class="outline-text-4" id="text-substantive">
<p>
The following substantive PRs were open when this agenda was prepared.
</p>

<ul class="org-ul">
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1513">#1513</a>: 1512 Disallow reserved names in namespace and PI constructors</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1511">#1511</a>: 1345 Re-allow bare-brace map constructors everywhere</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1504">#1504</a>: 868 fn:intersperse → fn:join, array:join($arrays, $separator)</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1501">#1501</a>: 1318 Function Coercion: Records, Maps, Arrays</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1498">#1498</a>: 1366 Use ++ and ** operators in EBNF</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1497">#1497</a>: 1471 JSON Serialization: json-lines</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1496">#1496</a>: 1495 Drop context value static type</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1454">#1454</a>: 1449 Relax rules on multiple xsl:includes</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1227">#1227</a>: 150 PR resubmission for fn ranks</li>
</ul>
</div>
</div>

<div id="outline-container-required-40" class="outline-4">
<h4 id="required-40"><span class="section-number-4">1.6.5.</span> Required for V4.0</h4>
<div class="outline-text-4" id="text-required-40">
<p>
The following issues are labeled “required for V4.0”.
</p>

<ul class="org-ul">
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1252">#1252</a>: Add a new function `fn:html-doc`</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1240">#1240</a>: $sequence-of-maps ? info()</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1238">#1238</a>: XSLT on-no-match="shallow-copy-all" - revised rules</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1169">#1169</a>: Maps &amp; Arrays: Consistency &amp; Terminology</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1127">#1127</a>: Binary resources</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1045">#1045</a>: Functions to manage namespace usage</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1021">#1021</a>: Extend `fn:doc`, `fn:collection` and `fn:uri-collection` with options maps</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1011">#1011</a>: fn:transform() improvements</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/986">#986</a>: Numeric Comparisons</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/967">#967</a>: XPath Appendix I: Comparisons</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/868">#868</a>: fn:intersperse → fn:join, array:join($arrays, $separator)</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/826">#826</a>: Arrays: Representation of single members of an array</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/767">#767</a>: parse-html(): case of SVG element names</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/748">#748</a>: Parse functions: consistency</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/689">#689</a>: fn:stack-trace: replace with $err:stack-trace</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/675">#675</a>: XSLT streaming rules for new constructs</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/501">#501</a>: Error handling: Rethrow errors; finally block</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/490">#490</a>: Control over schema validation in parse-xml(), doc(), etc.</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/407">#407</a>: XSLT-specific context properties used in function items</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/272">#272</a>: Setting parameter values in xsl:use-package</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/69">#69</a>: fn:document, fn:function-available: default arguments</li>
</ul>
</div>
</div>
</div>
</div>

<div id="outline-container-technical-agenda" class="outline-2">
<h2 id="technical-agenda"><span class="section-number-2">2.</span> Technical agenda</h2>
<div class="outline-text-2" id="text-technical-agenda">
</div>

<div id="outline-container-pr-1513" class="outline-3">
<h3 id="pr-1513"><span class="section-number-3">2.1.</span> PR #1513: 1512 Disallow reserved names in namespace and PI constructors</h3>
<div class="outline-text-3" id="text-pr-1513">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-1513">#1513</a>
</p>
</div>
</div>

<div id="outline-container-pr-1511" class="outline-3">
<h3 id="pr-1511"><span class="section-number-3">2.2.</span> PR #1511: 1345 Re-allow bare-brace map constructors everywhere</h3>
<div class="outline-text-3" id="text-pr-1511">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-1511">#1511</a>
</p>
</div>
</div>

<div id="outline-container-pr-1504" class="outline-3">
<h3 id="pr-1504"><span class="section-number-3">2.3.</span> PR #1504: 868 fn:intersperse → fn:join, array:join($arrays, $separator)</h3>
<div class="outline-text-3" id="text-pr-1504">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-1504">#1504</a>
</p>
</div>
</div>

<div id="outline-container-pr-1501" class="outline-3">
<h3 id="pr-1501"><span class="section-number-3">2.4.</span> PR #1501: 1318 Function Coercion: Records, Maps, Arrays</h3>
<div class="outline-text-3" id="text-pr-1501">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-1501">#1501</a>
</p>
</div>
</div>

<div id="outline-container-pr-1498" class="outline-3">
<h3 id="pr-1498"><span class="section-number-3">2.5.</span> PR #1498: 1366 Use ++ and ** operators in EBNF</h3>
<div class="outline-text-3" id="text-pr-1498">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-1498">#1498</a>
</p>
</div>
</div>

<div id="outline-container-pr-1497" class="outline-3">
<h3 id="pr-1497"><span class="section-number-3">2.6.</span> PR #1497: 1471 JSON Serialization: json-lines</h3>
<div class="outline-text-3" id="text-pr-1497">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-1497">#1497</a>
</p>
</div>
</div>

<div id="outline-container-pr-1496" class="outline-3">
<h3 id="pr-1496"><span class="section-number-3">2.7.</span> PR #1496: 1495 Drop context value static type</h3>
<div class="outline-text-3" id="text-pr-1496">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-1496">#1496</a>
</p>
</div>
</div>

<div id="outline-container-pr-1454" class="outline-3">
<h3 id="pr-1454"><span class="section-number-3">2.8.</span> PR #1454: 1449 Relax rules on multiple xsl:includes</h3>
<div class="outline-text-3" id="text-pr-1454">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-1454">#1454</a>
</p>
</div>
</div>
</div>

<div id="outline-container-any-other-business" class="outline-2">
<h2 id="any-other-business"><span class="section-number-2">3.</span> Any other business</h2>
<div class="outline-text-2" id="text-any-other-business">
</div>
</div>
</div>
</body>
</html>
